import sys
sys.stdin = open('input.txt')

# 16진수를 2진수 4자리로 변환
P = {
    '0': '0000',
    '1': '0001',
    '2': '0010',
    '3': '0011',
    '4': '0100',
    '5': '0101',
    '6': '0110',
    '7': '0111',
    '8': '1000',
    '9': '1001',
    'A': '1010',
    'B': '1011',
    'C': '1100',
    'D': '1101',
    'E': '1110',
    'F': '1111',
}

# 입력
T = int(input())
for tc in range(1, T + 1):
    # 16진수가 몇자리로 들어올지 몰라서 *를 사용해서 한번에 받음
    n, *num = input().split()
    # 결과를 담을 문자열 초기화
    ans = ''
    # 반복문을 통해서 결과값에 하나씩 변환된 값을 추가
    for number in num[0]:
        number = P[number]
        ans += number
    # 출력
    print(f'#{tc} {ans}')

